In [1]:
import numpy as np
import pandas as pd

In [2]:
# 引入几个示例数据方便展现用法
index = pd.date_range("3/29/2022", periods=8)

s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
print(s)

df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
df

a   -0.964826
b   -0.223675
c    1.046897
d   -0.217163
e   -0.627033
dtype: float64

                   A         B         C
2022-03-29  0.892180 -0.688470  0.083439
2022-03-30 -0.572841 -1.428619  0.975008
2022-03-31  0.346414  1.058603  1.812146
2022-04-01  0.282217 -0.498587  2.862076
2022-04-02  0.828394  0.766340 -0.130704
2022-04-03  0.002683 -1.304429  0.180063
2022-04-04  0.752957  0.411342  2.167044
2022-04-05 -0.477703  2.480973  0.352343

# head( ) 和 tail( )
To view a small sample of a `Series` or `DataFrame` object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number.

In [3]:
long_series = pd.Series(np.random.randn(1000))
long_series.head()  # 默认显示头部五个数据

0   -1.141822
1   -0.446562
2    0.406425
3    0.317438
4   -1.889708
dtype: float64

In [4]:
long_series.head(10)  # 自定义显示头部的数据的个数

0   -1.141822
1   -0.446562
2    0.406425
3    0.317438
4   -1.889708
5    1.212073
6   -0.909824
7    0.209896
8    1.309679
9    1.247532
dtype: float64

In [5]:
long_series.tail()  # 默认显示尾部五个数据

995   -0.103254
996   -1.236924
997    0.122173
998    2.323321
999   -1.146432
dtype: float64

In [6]:
long_series.tail(10)  # 自定义显示尾部的数据的个数

990   -1.132475
991    1.494700
992    1.089748
993    0.504949
994   -0.046458
995   -0.103254
996   -1.236924
997    0.122173
998    2.323321
999   -1.146432
dtype: float64

# attributes and underlying data  属性和底层数据

In [7]:
df

                   A         B         C
2022-03-29  0.892180 -0.688470  0.083439
2022-03-30 -0.572841 -1.428619  0.975008
2022-03-31  0.346414  1.058603  1.812146
2022-04-01  0.282217 -0.498587  2.862076
2022-04-02  0.828394  0.766340 -0.130704
2022-04-03  0.002683 -1.304429  0.180063
2022-04-04  0.752957  0.411342  2.167044
2022-04-05 -0.477703  2.480973  0.352343

In [8]:
df[:3]

                   A         B         C
2022-03-29  0.892180 -0.688470  0.083439
2022-03-30 -0.572841 -1.428619  0.975008
2022-03-31  0.346414  1.058603  1.812146

In [9]:
df.columns = [x.lower() for x in df.columns]

In [10]:
df

                   a         b         c
2022-03-29  0.892180 -0.688470  0.083439
2022-03-30 -0.572841 -1.428619  0.975008
2022-03-31  0.346414  1.058603  1.812146
2022-04-01  0.282217 -0.498587  2.862076
2022-04-02  0.828394  0.766340 -0.130704
2022-04-03  0.002683 -1.304429  0.180063
2022-04-04  0.752957  0.411342  2.167044
2022-04-05 -0.477703  2.480973  0.352343

In [11]:
df.columns = [9, 'you', '88']
df

                   9       you        88
2022-03-29  0.892180 -0.688470  0.083439
2022-03-30 -0.572841 -1.428619  0.975008
2022-03-31  0.346414  1.058603  1.812146
2022-04-01  0.282217 -0.498587  2.862076
2022-04-02  0.828394  0.766340 -0.130704
2022-04-03  0.002683 -1.304429  0.180063
2022-04-04  0.752957  0.411342  2.167044
2022-04-05 -0.477703  2.480973  0.352343

In [12]:
s

a   -0.964826
b   -0.223675
c    1.046897
d   -0.217163
e   -0.627033
dtype: float64

In [13]:
# 将 s 转换为 NumPy array
s.to_numpy()

array([-0.9648258 , -0.22367509,  1.04689719, -0.2171627 , -0.62703277])

In [14]:
# 或者使用 asarray( ) 方法
np.asarray(s)

array([-0.9648258 , -0.22367509,  1.04689719, -0.2171627 , -0.62703277])

In [15]:
df

                   9       you        88
2022-03-29  0.892180 -0.688470  0.083439
2022-03-30 -0.572841 -1.428619  0.975008
2022-03-31  0.346414  1.058603  1.812146
2022-04-01  0.282217 -0.498587  2.862076
2022-04-02  0.828394  0.766340 -0.130704
2022-04-03  0.002683 -1.304429  0.180063
2022-04-04  0.752957  0.411342  2.167044
2022-04-05 -0.477703  2.480973  0.352343

In [16]:
# When your DataFrame only has a single data type for all the columns, DataFrame.to_numpy() will return the underlying data.
# 将 df 转换为 NumPy array
df.to_numpy()

array([[ 8.92180281e-01, -6.88469836e-01,  8.34385895e-02],
       [-5.72841331e-01, -1.42861859e+00,  9.75007770e-01],
       [ 3.46414300e-01,  1.05860252e+00,  1.81214605e+00],
       [ 2.82216863e-01, -4.98586928e-01,  2.86207554e+00],
       [ 8.28393739e-01,  7.66340232e-01, -1.30704318e-01],
       [ 2.68251504e-03, -1.30442869e+00,  1.80062893e-01],
       [ 7.52957061e-01,  4.11342432e-01,  2.16704360e+00],
       [-4.77702918e-01,  2.48097278e+00,  3.52342751e-01]])

# matching / broadcasting behavior   匹配行为 / 广播行为

In [17]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.arange(3, 6), index=["a", "b", "c"]),
        "two": pd.Series(np.arange(7, 11), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.arange(3), index=["b", "c", "d"]),
    }
)

df

   one  two  three
a  3.0    7    NaN
b  4.0    8    0.0
c  5.0    9    1.0
d  NaN   10    2.0

In [18]:
selected_row = df.iloc[1]
print(selected_row)

print('-'*30)

selected_column = df["two"]
print(selected_column)

one      4.0
two      8.0
three    0.0
Name: b, dtype: float64
------------------------------
a     7
b     8
c     9
d    10
Name: two, dtype: int32

### [🧐***参考博客***](https://blog.csdn.net/wyf2017/article/details/107459509)
---
![](https://img-blog.csdnimg.cn/20200720111708736.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L3d5ZjIwMTc=,size_16,color_FFFFFF,t_70)

In [19]:
#  第一列的第一个、第二列的第一个、第三列的第一个     去减    selected_row
#  第一列的第二个、第二列的第二个、第三列的第二个     去减    selected_row
#  第一列的第三个、第二列的第三个、第三列的第三个     去减    selected_row
df.sub(selected_row, axis="columns")

   one  two  three
a -1.0 -1.0    NaN
b  0.0  0.0    0.0
c  1.0  1.0    1.0
d  NaN  2.0    2.0

In [20]:
df.sub(selected_row, axis=1)

   one  two  three
a -1.0 -1.0    NaN
b  0.0  0.0    0.0
c  1.0  1.0    1.0
d  NaN  2.0    2.0

In [21]:
#  第一行的第一个、第二行的第一个、第三行的第一个     去减    selected_column
#  第一行的第二个、第二行的第二个、第三行的第二个     去减    selected_column
#  第一行的第三个、第二行的第三个、第三行的第三个     去减    selected_column
df.sub(selected_column, axis="index")

   one  two  three
a -4.0    0    NaN
b -4.0    0   -8.0
c -4.0    0   -8.0
d  NaN    0   -8.0

In [22]:
df.sub(selected_column, axis=0)

   one  two  three
a -4.0    0    NaN
b -4.0    0   -8.0
c -4.0    0   -8.0
d  NaN    0   -8.0

# Comparing if objects are equivalent

In [23]:
df1 = pd.DataFrame({"col": ["foo", 0, np.nan]})
df1

   col
0  foo
1    0
2  NaN

In [24]:
df2 = pd.DataFrame({"col": [np.nan, 0, "foo"]}, index=[2, 1, 0])
df2

   col
2  NaN
1    0
0  foo

#### 😴Note that the Series or DataFrame index needs to be in the same order for equality to be True:

In [25]:
df1.equals(df2)

False

In [26]:
df2.sort_index()

   col
0  foo
1    0
2  NaN

In [27]:
df1.equals(df2.sort_index())

True

# Index of min/max values
The idxmin() and idxmax() functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values.

In [28]:
s1 = pd.Series([2, 6, 8, -3, -10])
s1.dtype

dtype('int64')

In [29]:
s1.idxmin()

4

In [30]:
s1.idxmax()

2

In [31]:
df1 = pd.DataFrame([[2, -3, 8, 4], [9, 30, -100, 35], [23, 43, -33, -66], [423, 9, -3, -88]], columns=['you', 'and', 'me', 'forever'])
df1

   you  and   me  forever
0    2   -3    8        4
1    9   30 -100       35
2   23   43  -33      -66
3  423    9   -3      -88

In [32]:
df1.idxmin(axis='index')

you        0
and        0
me         1
forever    3
dtype: int64

In [33]:
df1.idxmin(axis=0)

you        0
and        0
me         1
forever    3
dtype: int64

In [34]:
df1.idxmax(axis='columns')

0         me
1    forever
2        and
3        you
dtype: object

In [35]:
df1.idxmax(axis=1)

0         me
1    forever
2        and
3        you
dtype: object

# Mixed dtypes &nbsp;&nbsp;&nbsp;混合数据类型

In [36]:
mdf = pd.DataFrame(
    {
        "A": [1, 2, 3],
        "B": [1.0, 2.0, 3.0],
        "C": ["foo", "bar", "baz"],
        "D": pd.date_range("20130101", periods=3),
    }
)

mdf

   A    B    C          D
0  1  1.0  foo 2013-01-01
1  2  2.0  bar 2013-01-02
2  3  3.0  baz 2013-01-03

In [37]:
mdf.dtypes

A             int64
B           float64
C            object
D    datetime64[ns]
dtype: object

In [38]:
mdf.agg(["min", "sum"])

     A    B          C          D
min  1  1.0        bar 2013-01-01
sum  6  6.0  foobarbaz        NaT

# Transform API

In [39]:
tsdf = pd.DataFrame(
    np.random.randint(-30, 20, size=(10, 3)),
    columns=["A", "B", "C"],
    index=pd.date_range("3/30/2022", periods=10),
)
tsdf

             A   B   C
2022-03-30  -2  14 -12
2022-03-31 -27   5 -18
2022-04-01  -7  16 -14
2022-04-02 -23 -21  15
2022-04-03 -25 -10 -12
2022-04-04  -8  13  10
2022-04-05 -20 -30  -1
2022-04-06 -21  -1  -2
2022-04-07   7 -25 -20
2022-04-08 -24  17 -26

In [40]:
tsdf.iloc[3]

A   -23
B   -21
C    15
Name: 2022-04-02 00:00:00, dtype: int32

In [41]:
tsdf.iloc[3:7]

             A   B   C
2022-04-02 -23 -21  15
2022-04-03 -25 -10 -12
2022-04-04  -8  13  10
2022-04-05 -20 -30  -1

In [42]:
tsdf[3:7]

             A   B   C
2022-04-02 -23 -21  15
2022-04-03 -25 -10 -12
2022-04-04  -8  13  10
2022-04-05 -20 -30  -1

In [43]:
tsdf.loc['2022-04-01']

A    -7
B    16
C   -14
Name: 2022-04-01 00:00:00, dtype: int32

In [44]:
tsdf[3:7] = np.nan
tsdf

               A     B     C
2022-03-30  -2.0  14.0 -12.0
2022-03-31 -27.0   5.0 -18.0
2022-04-01  -7.0  16.0 -14.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06 -21.0  -1.0  -2.0
2022-04-07   7.0 -25.0 -20.0
2022-04-08 -24.0  17.0 -26.0

#### 😎Transform the entire frame. .transform() allows input functions as: a NumPy function, a string function name or a user defined function.

In [45]:
tsdf.transform(np.abs)

               A     B     C
2022-03-30   2.0  14.0  12.0
2022-03-31  27.0   5.0  18.0
2022-04-01   7.0  16.0  14.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  21.0   1.0   2.0
2022-04-07   7.0  25.0  20.0
2022-04-08  24.0  17.0  26.0

In [46]:
tsdf.transform('abs')

               A     B     C
2022-03-30   2.0  14.0  12.0
2022-03-31  27.0   5.0  18.0
2022-04-01   7.0  16.0  14.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  21.0   1.0   2.0
2022-04-07   7.0  25.0  20.0
2022-04-08  24.0  17.0  26.0

In [47]:
tsdf.transform(lambda x: abs(x))

               A     B     C
2022-03-30   2.0  14.0  12.0
2022-03-31  27.0   5.0  18.0
2022-04-01   7.0  16.0  14.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  21.0   1.0   2.0
2022-04-07   7.0  25.0  20.0
2022-04-08  24.0  17.0  26.0

In [48]:
np.abs(tsdf)

               A     B     C
2022-03-30   2.0  14.0  12.0
2022-03-31  27.0   5.0  18.0
2022-04-01   7.0  16.0  14.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  21.0   1.0   2.0
2022-04-07   7.0  25.0  20.0
2022-04-08  24.0  17.0  26.0

In [49]:
tsdf["A"].transform('abs')

2022-03-30     2.0
2022-03-31    27.0
2022-04-01     7.0
2022-04-02     NaN
2022-04-03     NaN
2022-04-04     NaN
2022-04-05     NaN
2022-04-06    21.0
2022-04-07     7.0
2022-04-08    24.0
Freq: D, Name: A, dtype: float64

## Transform with multiple functions
Passing multiple functions will yield a column MultiIndexed DataFrame. The first level will be the original frame column names; the second level will be the names of the transforming functions.

In [50]:
tsdf.transform([np.abs, lambda x: x + 1000])

                  A                 B                 C
           absolute <lambda> absolute <lambda> absolute <lambda>
2022-03-30      2.0    998.0     14.0   1014.0     12.0    988.0
2022-03-31     27.0    973.0      5.0   1005.0     18.0    982.0
2022-04-01      7.0    993.0     16.0   1016.0     14.0    986.0
2022-04-02      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-03      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-04      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-05      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-06     21.0    979.0      1.0    999.0      2.0    998.0
2022-04-07      7.0   1007.0     25.0    975.0     20.0    980.0
2022-04-08     24.0    976.0     17.0   1017.0     26.0    974.0

In [51]:
tsdf.transform([np.abs, lambda x: x + 1000]).columns

MultiIndex([('A', 'absolute'),
            ('A', '<lambda>'),
            ('B', 'absolute'),
            ('B', '<lambda>'),
            ('C', 'absolute'),
            ('C', '<lambda>')],
           )

Passing multiple functions to a Series will yield a DataFrame. The resulting column names will be the transforming functions.

In [52]:
tsdf["A"].transform([np.abs, lambda x: x + 1])

            absolute  <lambda>
2022-03-30       2.0      -1.0
2022-03-31      27.0     -26.0
2022-04-01       7.0      -6.0
2022-04-02       NaN       NaN
2022-04-03       NaN       NaN
2022-04-04       NaN       NaN
2022-04-05       NaN       NaN
2022-04-06      21.0     -20.0
2022-04-07       7.0       8.0
2022-04-08      24.0     -23.0

In [53]:
tsdf["A"].transform([np.abs, lambda x: x + 1]).columns

Index(['absolute', '<lambda>'], dtype='object')

# reindexing and altering labels 重新索引和更改标签

In [54]:
s1 = pd.Series(np.random.randint(-8, 20, size=5), index=['a', 'b', 'c', 'd', 'e'])
s1

a    16
b    17
c     6
d    13
e    18
dtype: int32

In [55]:
s1.reindex(['c', 'e', 'a', 'you', 'a', 'me', 'hahaha'])

c          6.0
e         18.0
a         16.0
you        NaN
a         16.0
me         NaN
hahaha     NaN
dtype: float64

In [56]:
df1 = pd.DataFrame(np.random.randint(-8, 100, size=(4, 3)), index=['a', 'b', 'c', 'd'], columns=['one', 'two', 'three'])
df1

   one  two  three
a   73   73     92
b   62   28     22
c   54    1     97
d   53   19     41

In [57]:
df1.reindex(index=['b', 'd', 'you', 'a'])

      one   two  three
b    62.0  28.0   22.0
d    53.0  19.0   41.0
you   NaN   NaN    NaN
a    73.0  73.0   92.0

In [58]:
df1.reindex(['b', 'd', 'you', 'a'], axis='index')  # axis=0 是一样的

      one   two  three
b    62.0  28.0   22.0
d    53.0  19.0   41.0
you   NaN   NaN    NaN
a    73.0  73.0   92.0

In [59]:
df1.reindex(columns=['two', 'happy', 'one', 'together'])

   two  happy  one  together
a   73    NaN   73       NaN
b   28    NaN   62       NaN
c    1    NaN   54       NaN
d   19    NaN   53       NaN

In [60]:
df1.reindex(['two', 'happy', 'one', 'together'], axis='columns')  # axis=1 是一样的

   two  happy  one  together
a   73    NaN   73       NaN
b   28    NaN   62       NaN
c    1    NaN   54       NaN
d   19    NaN   53       NaN

In [61]:
df1.reindex(index=['b', 'd', 'you', 'a'], columns=['two', 'happy', 'one', 'together'])  # index 、columns 同时重新索引

      two  happy   one  together
b    28.0    NaN  62.0       NaN
d    19.0    NaN  53.0       NaN
you   NaN    NaN   NaN       NaN
a    73.0    NaN  73.0       NaN

In [62]:
index_share1 = s1.reindex(df1.index)  # df1 的 index 与 s1 的index 有重叠，所以可以共享~
index_share1

a    16
b    17
c     6
d    13
dtype: int32

In [63]:
index_share1.index is df1.index

True

In [64]:
index_share2 = df1.reindex(s1.index, axis=0)
index_share2

    one   two  three
a  73.0  73.0   92.0
b  62.0  28.0   22.0
c  54.0   1.0   97.0
d  53.0  19.0   41.0
e   NaN   NaN    NaN

In [65]:
index_share2.index is s1.index

True

In [66]:
df = pd.DataFrame(np.random.randint(-10, 100, size=(3, 2)), index=['b', 'd', 'a'], columns=['three', 'two'])
df

   three  two
b     -6   89
d     75    4
a      6   59

In [67]:
df1

   one  two  three
a   73   73     92
b   62   28     22
c   54    1     97
d   53   19     41

In [68]:
# reindex_like( ) 方法
df1.reindex_like(df)

   three  two
b     22   28
d     41   19
a     92   73

# aligning objects with each other with align( )

In [69]:
s = pd.Series(np.random.randint(1, 50, size=5), index=['a', 'b', 'c', 'd', 'e'])
s

a    25
b    18
c    33
d    10
e    17
dtype: int32

In [70]:
s1 = s[:4]
s1

a    25
b    18
c    33
d    10
dtype: int32

In [71]:
s2 = s[2:]
s2

c    33
d    10
e    17
dtype: int32

In [72]:
s1.align(s2)  # 它返回一个包含两个重新索引Series的元组 。默认采用索引的并集，即 join='outer'

(a    25.0
 b    18.0
 c    33.0
 d    10.0
 e     NaN
 dtype: float64,
 a     NaN
 b     NaN
 c    33.0
 d    10.0
 e    17.0
 dtype: float64)

In [73]:
s1.align(s2, join='left')  # join='left': use the calling object’s index

(a    25
 b    18
 c    33
 d    10
 dtype: int32,
 a     NaN
 b     NaN
 c    33.0
 d    10.0
 dtype: float64)

In [74]:
s1.align(s2, join='right')  # join='right': use the passed object’s index

(c    33.0
 d    10.0
 e     NaN
 dtype: float64,
 c    33
 d    10
 e    17
 dtype: int32)

In [75]:
s1.align(s2, join='inner')  # join='inner': intersect the indexes

(c    33
 d    10
 dtype: int32,
 c    33
 d    10
 dtype: int32)

# filling while reindexing

In [76]:
rng = pd.date_range("30/3/2022", periods=8)
rng

DatetimeIndex(['2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06'],
              dtype='datetime64[ns]', freq='D')

In [77]:
ts = pd.Series(np.random.randint(10, 100, size=8), index=rng)
ts

2022-03-30    33
2022-03-31    25
2022-04-01    41
2022-04-02    73
2022-04-03    67
2022-04-04    66
2022-04-05    82
2022-04-06    53
Freq: D, dtype: int32

In [78]:
ts2 = ts[[1, 3, 6]]
ts2

2022-03-31    25
2022-04-02    73
2022-04-05    82
dtype: int32

In [79]:
ts2.reindex(ts.index)

2022-03-30     NaN
2022-03-31    25.0
2022-04-01     NaN
2022-04-02    73.0
2022-04-03     NaN
2022-04-04     NaN
2022-04-05    82.0
2022-04-06     NaN
Freq: D, dtype: float64

In [80]:
ts2.reindex(ts.index, method='ffill')  # 向前填充值

2022-03-30     NaN
2022-03-31    25.0
2022-04-01    25.0
2022-04-02    73.0
2022-04-03    73.0
2022-04-04    73.0
2022-04-05    82.0
2022-04-06    82.0
Freq: D, dtype: float64

In [81]:
ts2.reindex(ts.index, method='bfill')  # 向后填充值

2022-03-30    25.0
2022-03-31    25.0
2022-04-01    73.0
2022-04-02    73.0
2022-04-03    82.0
2022-04-04    82.0
2022-04-05    82.0
2022-04-06     NaN
Freq: D, dtype: float64

In [82]:
ts2.reindex(ts.index, method='nearest')  # 从最近的索引值填充

2022-03-30    25
2022-03-31    25
2022-04-01    73
2022-04-02    73
2022-04-03    73
2022-04-04    82
2022-04-05    82
2022-04-06    82
Freq: D, dtype: int32

These methods require that the indexes are ordered increasing or decreasing.

Note that the same result could have been achieved using fillna (except for method='nearest') or interpolate.

reindex() will raise a ValueError if the index is not monotonically increasing or decreasing. fillna() and interpolate() will not perform any checks on the order of the index.

# dropping labels from an axis

In [83]:
df1

   one  two  three
a   73   73     92
b   62   28     22
c   54    1     97
d   53   19     41

In [84]:
df1.drop(['a', 'd'], axis=0)

   one  two  three
b   62   28     22
c   54    1     97

In [85]:
df1.drop(['one', 'two'], axis=1)

   three
a     92
b     22
c     97
d     41

# renaming / mapping labels
The rename() method allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.

In [86]:
s1

a    25
b    18
c    33
d    10
dtype: int32

In [87]:
s1.rename(str.upper)

A    25
B    18
C    33
D    10
dtype: int32

In [88]:
s1.name

In [89]:
# https://blog.csdn.net/cuihuijun1hao/article/details/78155216
s1.rename("you", inplace=True)  # Series的 name 属性，在把该Series转为DataFrame时，可以作为 columns 的标签名

a    25
b    18
c    33
d    10
Name: you, dtype: int32

In [90]:
pd.DataFrame(s1)

   you
a   25
b   18
c   33
d   10

**-----------------------------------------------------------------------------------------------------------------------------------------------------**

In [91]:
df

   three  two
b     -6   89
d     75    4
a      6   59

In [92]:
df.rename(
    columns={"three": "foo", "two": "bar"},
    index={"a": "apple"},  # 想修改几个就修改几个
)

       foo  bar
b       -6   89
d       75    4
apple    6   59

In [93]:
df

   three  two
b     -6   89
d     75    4
a      6   59

In [94]:
# DataFrame.rename() also supports an “axis-style” calling convention, 
# where you specify a single mapper and the axis to apply that mapping to.
df.rename({"three": "foo", "two": "bar"}, axis=1)  # 或者 axis='columns'

   foo  bar
b   -6   89
d   75    4
a    6   59

In [95]:
df.rename({'d': 888888888888}, axis=0)  # 想修改几个就修改几个！！！

              three  two
b                -6   89
888888888888     75    4
a                 6   59

In [96]:
# The rename() method also provides an inplace named parameter that is by default False and copies the underlying data. 
# Pass inplace=True to rename the data in place.  
df.rename({'d': 888888888888}, axis=0, inplace=True)

In [97]:
df  # 发现 df 被修改了

              three  two
b                -6   89
888888888888     75    4
a                 6   59

---

# iteration 迭代

## In short, basic iteration (`for i in object`) produces:
- **Series**: values
- **DataFrame**: column labels

In [98]:
# 对于 Series， 打印值
s1

a    25
b    18
c    33
d    10
Name: you, dtype: int32

In [99]:
for value in s1:
    print(value)

25
18
33
10

In [100]:
# 对于DataFrame，打印列标签
df1

   one  two  three
a   73   73     92
b   62   28     22
c   54    1     97
d   53   19     41

In [101]:
for col in df1:
    print(col)

one
two
three

In [102]:
df1

   one  two  three
a   73   73     92
b   62   28     22
c   54    1     97
d   53   19     41

In [103]:
for (key, value) in df1.items():
    print(key, value, sep='\n')

one
a    73
b    62
c    54
d    53
Name: one, dtype: int32
two
a    73
b    28
c     1
d    19
Name: two, dtype: int32
three
a    92
b    22
c    97
d    41
Name: three, dtype: int32

**To iterate over the rows of a DataFrame, you can use the following methods:**

- iterrows(): Iterate over the rows of a DataFrame as (index, Series) pairs. This converts the rows to Series objects, which can change the dtypes and has some performance implications.

- itertuples(): Iterate over the rows of a DataFrame as namedtuples of the values. This is a lot faster than iterrows(), and is in most cases preferable to use to iterate over the values of a DataFrame.

In [104]:
df1

   one  two  three
a   73   73     92
b   62   28     22
c   54    1     97
d   53   19     41

In [105]:
for value in df1.itertuples():
    print(value, sep='\n')

Pandas(Index='a', one=73, two=73, three=92)
Pandas(Index='b', one=62, two=28, three=22)
Pandas(Index='c', one=54, two=1, three=97)
Pandas(Index='d', one=53, two=19, three=41)

In [106]:
for row_index, row in df1.iterrows():
    print(row_index, '\n', row, '\n')

a
 one      73
two      73
three    92
Name: a, dtype: int32

b
 one      62
two      28
three    22
Name: b, dtype: int32

c
 one      54
two       1
three    97
Name: c, dtype: int32

d
 one      53
two      19
three    41
Name: d, dtype: int32

In [107]:
df1

   one  two  three
a   73   73     92
b   62   28     22
c   54    1     97
d   53   19     41

In [108]:
# You should never modify something you are iterating over. 
# This is not guaranteed to work in all cases. 
# Depending on the data types, the iterator returns a copy and not a view, and writing to it will have no effect! 
for index, row in df1.iterrows():
    row[0] = 10

In [109]:
df1

   one  two  three
a   10   73     92
b   10   28     22
c   10    1     97
d   10   19     41

# vectorized string methods 向量化的字符串方法

In [110]:
s = pd.Series(["A", "B", "C", 888, "Aaba", "Baca", np.nan, "CABA", 666, "dog", "cat"], dtype="string")
s

0        A
1        B
2        C
3      888
4     Aaba
5     Baca
6     <NA>
7     CABA
8      666
9      dog
10     cat
dtype: string

In [111]:
s[3]

'888'

In [112]:
type(s[3])

str

In [113]:
s[6]  # 只有是数值型的才是NaN(Not a Number)，这里是字符串，所以是NA(Not Available)

In [114]:
type(s[6])

pandas._libs.missing.NAType

In [115]:
s.str.lower()

0        a
1        b
2        c
3      888
4     aaba
5     baca
6     <NA>
7     caba
8      666
9      dog
10     cat
dtype: string